app/Cart.php

    public function addToCart($request)
    {
    	  $res=new Cart;
    	  $res->product_id=Crypt::decrypt($request->id);
    	  $res->status=1;
    	if(\Auth::guard('user_login')->check()){
      	  $res->user_id=\Auth::guard('user_login')->user()->id;
    	}
    	  $res->ip=$request->ip();
    	  $res->save();

          $cart_count=self::where('ip',$request->ip())->count();
          $cart_product=Product::where('id',$res->product_id)->first();
---
select count(*) as aggregate from `carts` where `ip` = '::1'
select * from `products` where `id` = 26 limit 1

    public function checkout($request)
    {
       if(!Auth::guard('user_login')->check()){
          flashMessage('error','You Are not login');
          return redirect()->back();
       }

      $cart=self::with(['product'])->where('ip',$request->ip())->where('user_id',Auth::guard('user_login')->user()->id)->get();
---
select * from `carts` where `ip` = '::1' and `user_id` = 11
select * from `products` where `products`.`id` in (25, 26)