app/Order.php

    public function SingleStatusChange($r){

      $l = self::where('id',\Crypt::decrypt($r->id))->first();
      if ($l !=NULL) {

          if ($l->status == 1) {
            $l->status = self::STATUS_INACTIVE;
          }else{
            $l->status = self::STATUS_ACTIVE;
          }
          $l->save();
---
select * from `orders` where `id` = 33 limit 1
update `orders` set `status` = '1', `orders`.`updated_at` = '2021-12-15 04:18:12' where `id` = 33

     public function getOrderProductListData($request,$id){
      $sql=Product::with(['product_order'])->has('product_order')
                   ->whereHas('product_order',function($qu) use($id)
                   {
                      $qu->where('order_id',Crypt::decrypt($id));
                   });
                   // dd($sql[0]->product_order[0]->quantity);
      return Datatables::of($sql)
                        ->editColumn('id',function($data){
                            return '<input type="checkbox" name="checkbox[]" class="select_checkbox_value" value="'.Crypt::encrypt($data->id).'" />';
                        })
                        ->editColumn('image',function($data){
                            return '<img style="height:50px;width:100px" src="'.$data->getProductImageUrl().'"/>';
                         })
                        ->editColumn('quantity',function($data)
                        {
                          return $data->product_order[0]->quantity;
                        })
                        ->filter(function ($query) use ($request) {

                            if (isset($request['status']) && $request['status'] != "") {
                                $query->where('status', $request['status']);
                            }
                            if (isset($request['name']) && $request['name'] != "") {
                                $query->where('name', 'like', '%' . $request->name . '%');
                            }
                        })
                        ->rawColumns(['id','image','status'])
---
select * from `products` where exists (select * from `order_product` where `products`.`id` = `order_product`.`product_id`) and exists (select * from `order_product` where `products`.`id` = `order_product`.`product_id` and `order_id` = 29)