app/UserLogin.php

    public function userLogin($request)
    {
    	if(Auth::guard('user_login')->attempt(['email'=>$request->email, 'password'=>$request->password])){
    		// dd('dfgf');
    		$msg="Login successful";
    		$errors="";
    		flashMessage('success',$msg);
            $res=\App\Cart::where('ip',$request->ip())->get();
---
select * from `carts` where `ip` = '::1'