app/Http/Controllers/CartController.php

    public function index(Request $request)
    {
        $title="Cart";
        $cart_product=Cart::with(['product'])->where('ip',$request->ip())->get();
---
select * from `carts` where `ip` = '::1'
select * from `products` where `products`.`id` in (23, 24)