app/Http/Controllers/CategoryController.php

    public function subCategory($slug)
    {

      // $subCategory = \App\Models\SubCategory::with(['category'=>function($query){

      //                                     $query->where('status',\App\Models\Category::STATUS_ACTIVE);

      //                                   }])
      //                                   ->where('slug',$slug)
      //                                   ->where('status',\App\Models\SubCategory::STATUS_ACTIVE)
      //                                   ->whereHas('category',function($query){

      //                                       $query->where('status',\App\Models\Category::STATUS_ACTIVE);
      //                                   })
      //                                   ->firstOrFail();

      //   $products = \App\Models\Product::with(['image'])->where('category_id',$subCategory->id)
      //                                           ->where('status',\App\Models\Product::STATUS_ACTIVE)
      //                                           ->paginate(getDefaultPagiantion());

      //   $title = $subCategory->name;

      //   return view('front.category.sub_category',compact('title','products','subCategory'));


      $category = \App\Models\SubCategory::where('slug',$slug)
                  ->where('status',\App\Models\Category::STATUS_ACTIVE)
                ->firstOrFail();
---
select * from `sub_category` where `slug` = 'favicon.ico' and `status` = '1' limit 1