app/Http/Controllers/HomeController.php

select * from `category` where exists (select * from `sub_category` where `category`.`id` = `sub_category`.`category_id` and `status` = '1' and exists (select * from `products` where `sub_category`.`id` = `products`.`category_id` and `status` = '1')) and `is_featured` = 1 and `status` = '1' limit 6
select * from `banners` where `status` = '1'
---
         //    ->take(6)
         //    ->get();

         $featureProduct=\App\Models\Category::with(['subCategory'])
                                              ->whereHas('subCategory',function($q)
                                              {
                                                $q->where('status',\App\Models\SubCategory::STATUS_ACTIVE)
                                                  ->whereHas('products',function($qu)
                                                  {
                                                      $qu->where('status',\App\Models\Product::STATUS_ACTIVE);
                                                  });
                                              })
                                              ->where('is_featured',1)
                                              ->where('status',\App\Models\Category::STATUS_ACTIVE)
                                              ->take(6)
                                              ->get();


        $banners = \App\Models\Banner::where('status',\App\Models\Banner::STATUS_ACTIVE)->get();

select * from `products` where `products`.`category_id` in (1, 2, 5, 6, 7)
select * from `sub_category` where `sub_category`.`category_id` in (1)
---
        //                                   })
        //                                   -> where('status',\App\Models\SubCategory::STATUS_ACTIVE)->get();

         $category_home=\App\Models\Category::with(['subCategory','subCategory.products'])
                                            ->whereHas('subCategory',function($q)
                                            {
                                              $q->select('id','name','slug')
                                                ->where('status',\App\Models\subCategory::STATUS_ACTIVE)
                                                ->whereHas('products',function($qu)
                                                {
                                                  $qu->where('status',\App\Models\Product::STATUS_ACTIVE);
                                                });
                                            })
                                            ->where('is_home',1)
                                            ->where('status',\App\Models\Category::STATUS_ACTIVE)
                                            ->take(2)
                                            ->get();

select * from `order_product` where `order_product`.`order_id` in (32, 33, 34)
select * from `orders` where exists (select * from `order_product` where `orders`.`id` = `order_product`.`order_id`) and `user_id` = 11 and `is_delivered` = 0
select * from `products` where `products`.`id` in (23, 24, 25, 26)
---
    public function myaccount(Request $request)
    {
      if (!\Auth::guard('user_login')->check()) {
        flashMessage('error','You are not login');
        return redirect()->route('front.home');
      }
      // $orders=Product::with(['product_order'])
      //                  ->whereHas('product_order',function($q)
      //                  {
      //                     $q->whereHas('order',function($qu)
      //                     {
      //                       $qu->where('user_id',\Auth::guard('user_login')->user()->id);
      //                     });
      //                  })
      //                  ->get();

       $orders=Order::with(['order_product','order_product.product'])
                     ->has('order_product')
                     ->where('user_id',\Auth::guard('user_login')->user()->id)
                     ->where('is_delivered',0)
                     ->get();

select * from `order_product` where `order_product`.`order_id` in (32, 33, 34)
select * from `orders` where exists (select * from `order_product` where `orders`.`id` = `order_product`.`order_id`) and `user_id` = 11
select * from `products` where `products`.`id` in (23, 24, 25, 26)
---
    public function orderHistory(Request $request)
    {
        $orders=Order::with(['order_product','order_product.product'])
                     ->has('order_product')
                     ->where('user_id',\Auth::guard('user_login')->user()->id)
                     ->get();