app/Http/Controllers/PaymentController.php

    public function index(Request $request)
    {
        $title="Payment";
        $total=\Crypt::decrypt($request->amount);
            $receipt=\Str::random(20);
            $api = new Api(env('RAZOR_KEY'), env('RAZOR_SECRET'));
            $order  = $api->order->create(array('receipt' => $receipt, 'amount' => $total*100 , 'currency' => 'INR'));


            $re=new Order;
            $re->name=$request->name;
            $re->amount=$total;
            $re->email=$request->email;
            $re->city=$request->city;
            $re->address=$request->address;
            $re->user_id=\Auth::guard('user_login')->user()->id;
            $re->post_code=$request->post_code;
            $re->state=$request->state;
            $re->country=$request->country;
            $re->mobile=$request->mobile;
            $re->save();
---
insert into `orders` (`name`, `amount`, `email`, `city`, `address`, `user_id`, `post_code`, `state`, `country`, `mobile`, `updated_at`, `created_at`) values ('harsh vaghasiya', 121, 'harshvghasiya@gmail.com', 'Bhavnagar', '', 11, '364004', '3513', '244', '09724434838', '2021-12-15 04:05:47', '2021-12-15 04:05:47')

    public function store(Request $request)
    {

         $success=false;
        try {
        $api = new Api(env('RAZOR_KEY'), env('RAZOR_SECRET'));
        $attributes  = array('razorpay_signature'  => $request->rzp_signature,  'razorpay_payment_id'  => $request->rzp_paymentid ,  'razorpay_order_id' => $request->rzp_orderid);
        $order  = $api->utility->verifyPaymentSignature($attributes);

        $success=true;

        } catch (Exception $e) {
            $success=false;
        }

        if ($success==true) {
            $res=new Payment;
            $res->user_id =\Auth::guard('user_login')->user()->id;
            $res->payment_id=$request->rzp_paymentid;
            $res->amount=$request->amount;
            $res->save();

            $re=Order::find($request->id);
            $re->payment_id=$request->rzp_paymentid;
            $re->status=1;
            $re->save();

            $cart=Cart::where('ip',$request->ip())->where('user_id',\Auth::guard('user_login')->user()->id)->delete();
---
insert into `payments` (`user_id`, `payment_id`, `amount`, `updated_at`, `created_at`) values (11, 'pay_IXyjBTsvH24wh4', '24400', '2021-12-16 02:17:30', '2021-12-16 02:17:30')
update `orders` set `status` = 1, `payment_id` = 'pay_IXyjBTsvH24wh4', `orders`.`updated_at` = '2021-12-16 02:17:30' where `id` = 34
delete from `carts` where `ip` = '::1' and `user_id` = 11