app/Http/Controllers/ProductController.php

    public function collection(Request $request,$slug)
    {
       switch ($slug) {
         case 'new-arrivals':
            $products=\App\Models\Product::where('status',\App\Models\Product::STATUS_ACTIVE)->orderBy('created_at','DESC')->paginate(getDefaultPagiantion());
---
select * from `products` where `status` = '1' order by `created_at` desc limit 9 offset 0
select count(*) as aggregate from `products` where `status` = '1'